{"weightsManifest": [{"paths": ["group1-shard1of12.bin", "group1-shard2of12.bin", "group1-shard3of12.bin", "group1-shard4of12.bin", "group1-shard5of12.bin", "group1-shard6of12.bin", "group1-shard7of12.bin", "group1-shard8of12.bin", "group1-shard9of12.bin", "group1-shard10of12.bin", "group1-shard11of12.bin", "group1-shard12of12.bin"], "weights": [{"dtype": "float32", "shape": [3], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv3/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [7, 7, 128, 3], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv3/Conv2D/ReadVariableOp"}, {"dtype": "int32", "shape": [4, 2], "name": "StatefulPartitionedCall/Cartoon_Generator/zero_padding2d/Pad/paddings"}, {"dtype": "int32", "shape": [3], "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Mean/reduction_indices"}, {"dtype": "float32", "shape": [128], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [128], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv11_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv11_2/Conv2D/ReadVariableOp"}, {"dtype": "int32", "shape": [4, 2], "name": "StatefulPartitionedCall/Cartoon_Generator/zero_padding2d_15/Pad/paddings"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv11_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv11_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [], "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_1/add/y"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv10_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv10_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv10_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv10_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv9_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv9_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv9_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv9_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv8_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv8_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv8_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv8_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv7_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv7_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv7_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv7_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv6_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv6_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv6_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv6_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv5_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv5_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv5_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv5_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv4_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv4_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv4_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv4_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv3_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv3_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv3_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 128, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/conv3_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [128], "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_2/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_2/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [128], "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [64], "name": "StatefulPartitionedCall/Cartoon_Generator/conv1/BiasAdd/ReadVariableOp"}, {"dtype": "float32", "shape": [7, 7, 3, 64], "name": "StatefulPartitionedCall/Cartoon_Generator/conv1/Conv2D/ReadVariableOp"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm3/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm3/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm4_1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm4_1/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm4_2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm4_2/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm5_1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm5_1/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm5_2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm5_2/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm6_1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm6_1/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm6_2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm6_2/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm7_1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm7_1/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm7_2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm7_2/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm8_1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm8_1/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm8_2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm8_2/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm9_1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm9_1/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm9_2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm9_2/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm10_1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm10_1/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm10_2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm10_2/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_1/Reshape_1"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_2/Reshape_1"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_1/conv2d_transpose/ReadVariableOp"}, {"dtype": "int32", "shape": [], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_1/stack/3"}, {"dtype": "int32", "shape": [], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/mul/y"}, {"dtype": "int32", "shape": [1], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/strided_slice/stack_1"}, {"dtype": "int32", "shape": [1], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/strided_slice_2/stack_1"}, {"dtype": "int32", "shape": [1], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/strided_slice_1/stack_1"}, {"dtype": "int32", "shape": [1], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/strided_slice/stack"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv1/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv1/Reshape_1"}, {"dtype": "float32", "shape": [3, 3, 128, 256], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/conv2d_transpose/ReadVariableOp"}, {"dtype": "int32", "shape": [], "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/stack/3"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Reshape"}, {"dtype": "float32", "shape": [1, 1, 1, 1], "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Reshape_1"}]}], "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "name": "input", "op": "Placeholder"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv3/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "128"}, {"size": "3"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv3/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/zero_padding2d/Pad/paddings", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Mean/reduction_indices", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv11_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv11_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/zero_padding2d_15/Pad/paddings", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv11_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv11_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_1/add/y", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv10_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv10_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv10_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv10_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv9_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv9_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv9_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv9_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv8_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv8_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv8_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv8_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv7_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv7_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv7_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv7_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv6_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv6_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv6_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv6_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv5_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv5_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv5_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv5_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv4_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv4_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv4_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv4_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv3_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv3_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv3_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv3_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_2/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_2/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv1/BiasAdd/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv1/Conv2D/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm3/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm3/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm4_1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm4_1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm4_2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm4_2/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm5_1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm5_1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm5_2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm5_2/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm6_1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm6_1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm6_2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm6_2/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm7_1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm7_1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm7_2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm7_2/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm8_1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm8_1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm8_2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm8_2/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm9_1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm9_1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm9_2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm9_2/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm10_1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm10_1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm10_2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm10_2/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm11_2/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_1/conv2d_transpose/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv1_1/stack/3", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/mul/y", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/strided_slice/stack_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/strided_slice_2/stack_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/strided_slice_1/stack_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/strided_slice/stack", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv1/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv1/Reshape_1", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/conv2d_transpose/ReadVariableOp", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/deconv2_1/stack/3", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Reshape", "op": "Const"}, {"input": ["^input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Reshape_1", "op": "Const"}, {"input": ["input", "StatefulPartitionedCall/Cartoon_Generator/zero_padding2d/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/zero_padding2d/Pad", "op": "Pad"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/zero_padding2d/Pad", "StatefulPartitionedCall/Cartoon_Generator/conv1/Conv2D/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv1/Conv2D", "op": "Conv2D"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/conv1/Conv2D", "StatefulPartitionedCall/Cartoon_Generator/conv1/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv1/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/conv1/BiasAdd", "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/Mean", "op": "Mean"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/conv1/BiasAdd", "StatefulPartitionedCall/Cartoon_Generator/norm1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/sub", "op": "Sub"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/reduce_std/reduce_variance/Square", "op": "Square"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm1/reduce_std/reduce_variance/Square", "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/reduce_std/reduce_variance/Mean_1", "op": "Mean"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm1/reduce_std/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/reduce_std/Sqrt", "op": "Sqrt"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm1/reduce_std/Sqrt", "StatefulPartitionedCall/Cartoon_Generator/norm11_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/add", "op": "Add"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm1/sub", "StatefulPartitionedCall/Cartoon_Generator/norm1/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/truediv", "op": "RealDiv"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm1/Reshape", "StatefulPartitionedCall/Cartoon_Generator/norm1/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/mul", "op": "Mul"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm1/Reshape_1", "StatefulPartitionedCall/Cartoon_Generator/norm1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm1/add_1", "op": "Add"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/activation/Relu", "op": "Relu"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/activation/Relu", "StatefulPartitionedCall/Cartoon_Generator/conv2_1/Conv2D/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_1/Conv2D", "op": "Conv2D"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/conv2_1/Conv2D", "StatefulPartitionedCall/Cartoon_Generator/conv2_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_1/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/conv2_1/BiasAdd", "StatefulPartitionedCall/Cartoon_Generator/conv2_2/Conv2D/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_2/Conv2D", "op": "Conv2D"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/conv2_2/Conv2D", "StatefulPartitionedCall/Cartoon_Generator/conv2_2/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "StatefulPartitionedCall/Cartoon_Generator/conv2_2/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/conv2_2/BiasAdd", "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/Mean", "op": "Mean"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/conv2_2/BiasAdd", "StatefulPartitionedCall/Cartoon_Generator/norm2/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/sub", "op": "Sub"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/reduce_std/reduce_variance/Square", "op": "Square"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm2/reduce_std/reduce_variance/Square", "StatefulPartitionedCall/Cartoon_Generator/norm_deconv2/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/reduce_std/reduce_variance/Mean_1", "op": "Mean"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm2/reduce_std/reduce_variance/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/reduce_std/Sqrt", "op": "Sqrt"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm11_1/add/y", "StatefulPartitionedCall/Cartoon_Generator/norm2/reduce_std/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/add", "op": "Add"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm2/sub", "StatefulPartitionedCall/Cartoon_Generator/norm2/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/truediv", "op": "RealDiv"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm2/Reshape", "StatefulPartitionedCall/Cartoon_Generator/norm2/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/mul", "op": "Mul"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm2/Reshape_1", "StatefulPartitionedCall/Cartoon_Generator/norm2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/norm2/add_1", "op": "Add"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/norm2/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/Cartoon_Generator/activation_1/Relu", "op": "Relu"}, {"input": ["StatefulPartitionedCall/Cartoon_Generator/activation_1/Relu", "StatefulPartitionedCall/Cartoon_Generator/conv3_1/Conv2D/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", 