{"modelTopology":{"node":[{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in13_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv02_1/conv2d_transpose/output_shape/3","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/deconv02_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in12_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv02_1/strided_slice/stack","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv02_1/strided_slice_1/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv02_1/strided_slice_2/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv02_1/strided_slice/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv02_1/mul/y","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv02_1/add/y","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv01_1/conv2d_transpose/output_shape/3","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/deconv01_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in11_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in11_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv11_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv11_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in11_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv11_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv11_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in11_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in10_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in10_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv10_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv10_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in10_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv10_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv10_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in10_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in09_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in09_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv09_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv09_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in09_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv09_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv09_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in09_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in08_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in08_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv08_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv08_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in08_1/gamma","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}},"name":"generator_shinkai/conv08_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv08_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in08_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in07_2/beta","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}}},"name":"generator_shinkai/in07_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv07_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv07_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in07_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv07_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv07_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in07_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in06_2/beta","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}}},"name":"generator_shinkai/in06_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv06_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv06_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in06_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv06_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv06_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in06_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in05_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in05_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv05_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv05_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in05_1/gamma","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}},"name":"generator_shinkai/conv05_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv05_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in05_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in04_2/beta","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}}},"name":"generator_shinkai/in04_1/beta","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}},"name":"generator_shinkai/conv04_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv04_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in04_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv04_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv04_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in04_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in03_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in02_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in01_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"7"},{"size":"7"},{"size":"3"},{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv01_1/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}}},"name":"generator_shinkai/conv01_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in01_1/gamma","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"128"}]}}}},"name":"generator_shinkai/conv02_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv02_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv02_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv02_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in02_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv03_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv03_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv03_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/conv03_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in03_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/deconv01_1/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}}},"name":"generator_shinkai/deconv01_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/deconv01_2/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}}},"name":"generator_shinkai/in12_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv01_1/strided_slice_3/stack","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv01_1/strided_slice_3/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":3}},"name":"generator_shinkai/deconv01_1/strided_slice_3/stack_2","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/deconv02_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":3}},"name":"generator_shinkai/Pad_15/paddings","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/deconv02_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/deconv02_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":3}},"name":"generator_shinkai/in11_1/moments/mean/reduction_indices","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[]}}},"dtype":{"type":1}},"name":"generator_shinkai/in11_1/instancenorm/add/y","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/in13_1/gamma","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}},"name":"generator_shinkai/Pad/paddings","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"7"},{"size":"7"},{"size":"64"},{"size":"3"}]}}}},"name":"generator_shinkai/deconv03_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":1}},"name":"generator_shinkai/deconv03_1/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"shape":{"shape":{"dim":[{"size":"-1"},{"size":"-1"},{"size":"-1"},{"size":"3"}]}}},"name":"generator_shinkai/input","op":"Placeholder"},{"input":["generator_shinkai/input","generator_shinkai/Pad/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator_shinkai/Pad","op":"Pad"},{"input":["generator_shinkai/Pad","generator_shinkai/conv01_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator_shinkai/conv01_1/Conv2D","op":"Conv2D"},{"input":["generator_shinkai/conv01_1/Conv2D","generator_shinkai/conv01_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator_shinkai/conv01_1/BiasAdd","op":"BiasAdd"},{"input":["generator_shinkai/conv01_1/BiasAdd","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"Tidx":{"type":3},"keep_dims":{"b":true}},"name":"generator_shinkai/in01_1/moments/mean","op":"Mean"},{"input":["generator_shinkai/conv01_1/BiasAdd","generator_shinkai/in01_1/moments/mean"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in01_1/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator_shinkai/in01_1/moments/SquaredDifference","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"Tidx":{"type":3},"keep_dims":{"b":true},"T":{"type":1}},"name":"generator_shinkai/in01_1/moments/variance","op":"Mean"},{"input":["generator_shinkai/in01_1/moments/variance","generator_shinkai/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in01_1/instancenorm/add","op":"Add"},{"input":["generator_shinkai/in01_1/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in01_1/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator_shinkai/in01_1/instancenorm/Rsqrt","generator_shinkai/in01_1/gamma"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in01_1/instancenorm/mul","op":"Mul"},{"input":["generator_shinkai/conv01_1/BiasAdd","generator_shinkai/in01_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in01_1/instancenorm/mul_1","op":"Mul"},{"input":["generator_shinkai/in01_1/moments/mean","generator_shinkai/in01_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in01_1/instancenorm/mul_2","op":"Mul"},{"input":["generator_shinkai/in01_1/beta","generator_shinkai/in01_1/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in01_1/instancenorm/sub","op":"Sub"},{"input":["generator_shinkai/in01_1/instancenorm/mul_1","generator_shinkai/in01_1/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in01_1/instancenorm/add_1","op":"Add"},{"input":["generator_shinkai/in01_1/instancenorm/add_1"],"attr":{"T":{"type":1}},"name":"generator_shinkai/Relu","op":"Relu"},{"input":["generator_shinkai/Relu","generator_shinkai/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator_shinkai/conv02_1/Pad","op":"Pad"},{"input":["generator_shinkai/conv02_1/Pad","generator_shinkai/conv02_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator_shinkai/conv02_1/Conv2D","op":"Conv2D"},{"input":["generator_shinkai/conv02_1/Conv2D","generator_shinkai/conv02_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator_shinkai/conv02_1/BiasAdd","op":"BiasAdd"},{"input":["generator_shinkai/conv02_1/BiasAdd","generator_shinkai/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator_shinkai/conv02_2/Pad","op":"Pad"},{"input":["generator_shinkai/conv02_2/Pad","generator_shinkai/conv02_2/kernel"],"attr":{"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true}},"name":"generator_shinkai/conv02_2/Conv2D","op":"Conv2D"},{"input":["generator_shinkai/conv02_2/Conv2D","generator_shinkai/conv02_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator_shinkai/conv02_2/BiasAdd","op":"BiasAdd"},{"input":["generator_shinkai/conv02_2/BiasAdd","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"Tidx":{"type":3},"keep_dims":{"b":true},"T":{"type":1}},"name":"generator_shinkai/in02_1/moments/mean","op":"Mean"},{"input":["generator_shinkai/conv02_2/BiasAdd","generator_shinkai/in02_1/moments/mean"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in02_1/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator_shinkai/in02_1/moments/SquaredDifference","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"Tidx":{"type":3},"keep_dims":{"b":true}},"name":"generator_shinkai/in02_1/moments/variance","op":"Mean"},{"input":["generator_shinkai/in02_1/moments/variance","generator_shinkai/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in02_1/instancenorm/add","op":"Add"},{"input":["generator_shinkai/in02_1/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in02_1/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator_shinkai/in02_1/instancenorm/Rsqrt","generator_shinkai/in02_1/gamma"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in02_1/instancenorm/mul","op":"Mul"},{"input":["generator_shinkai/conv02_2/BiasAdd","generator_shinkai/in02_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in02_1/instancenorm/mul_1","op":"Mul"},{"input":["generator_shinkai/in02_1/moments/mean","generator_shinkai/in02_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in02_1/instancenorm/mul_2","op":"Mul"},{"input":["generator_shinkai/in02_1/beta","generator_shinkai/in02_1/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in02_1/instancenorm/sub","op":"Sub"},{"input":["generator_shinkai/in02_1/instancenorm/mul_1","generator_shinkai/in02_1/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in02_1/instancenorm/add_1","op":"Add"},{"input":["generator_shinkai/in02_1/instancenorm/add_1"],"attr":{"T":{"type":1}},"name":"generator_shinkai/Relu_1","op":"Relu"},{"input":["generator_shinkai/Relu_1","generator_shinkai/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator_shinkai/conv03_1/Pad","op":"Pad"},{"input":["generator_shinkai/conv03_1/Pad","generator_shinkai/conv03_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator_shinkai/conv03_1/Conv2D","op":"Conv2D"},{"input":["generator_shinkai/conv03_1/Conv2D","generator_shinkai/conv03_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator_shinkai/conv03_1/BiasAdd","op":"BiasAdd"},{"input":["generator_shinkai/conv03_1/BiasAdd","generator_shinkai/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator_shinkai/conv03_2/Pad","op":"Pad"},{"input":["generator_shinkai/conv03_2/Pad","generator_shinkai/conv03_2/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator_shinkai/conv03_2/Conv2D","op":"Conv2D"},{"input":["generator_shinkai/conv03_2/Conv2D","generator_shinkai/conv03_2/bias"],"attr":{"data_format":{"s":[78,72,87,67]},"T":{"type":1}},"name":"generator_shinkai/conv03_2/BiasAdd","op":"BiasAdd"},{"input":["generator_shinkai/conv03_2/BiasAdd","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"Tidx":{"type":3},"keep_dims":{"b":true}},"name":"generator_shinkai/in03_1/moments/mean","op":"Mean"},{"input":["generator_shinkai/conv03_2/BiasAdd","generator_shinkai/in03_1/moments/mean"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in03_1/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator_shinkai/in03_1/moments/SquaredDifference","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"Tidx":{"type":3},"keep_dims":{"b":true},"T":{"type":1}},"name":"generator_shinkai/in03_1/moments/variance","op":"Mean"},{"input":["generator_shinkai/in03_1/moments/variance","generator_shinkai/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in03_1/instancenorm/add","op":"Add"},{"input":["generator_shinkai/in03_1/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in03_1/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator_shinkai/in03_1/instancenorm/Rsqrt","generator_shinkai/in03_1/gamma"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in03_1/instancenorm/mul","op":"Mul"},{"input":["generator_shinkai/conv03_2/BiasAdd","generator_shinkai/in03_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in03_1/instancenorm/mul_1","op":"Mul"},{"input":["generator_shinkai/in03_1/moments/mean","generator_shinkai/in03_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in03_1/instancenorm/mul_2","op":"Mul"},{"input":["generator_shinkai/in03_1/beta","generator_shinkai/in03_1/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in03_1/instancenorm/sub","op":"Sub"},{"input":["generator_shinkai/in03_1/instancenorm/mul_1","generator_shinkai/in03_1/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in03_1/instancenorm/add_1","op":"Add"},{"input":["generator_shinkai/in03_1/instancenorm/add_1"],"attr":{"T":{"type":1}},"name":"generator_shinkai/Relu_2","op":"Relu"},{"input":["generator_shinkai/Relu_2","generator_shinkai/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator_shinkai/Pad_1","op":"Pad"},{"input":["generator_shinkai/Pad_1","generator_shinkai/conv04_1/kernel"],"attr":{"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true}},"name":"generator_shinkai/conv04_1/Conv2D","op":"Conv2D"},{"input":["generator_shinkai/conv04_1/Conv2D","generator_shinkai/conv04_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator_shinkai/conv04_1/BiasAdd","op":"BiasAdd"},{"input":["generator_shinkai/conv04_1/BiasAdd","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"Tidx":{"type":3},"keep_dims":{"b":true},"T":{"type":1}},"name":"generator_shinkai/in04_1/moments/mean","op":"Mean"},{"input":["generator_shinkai/conv04_1/BiasAdd","generator_shinkai/in04_1/moments/mean"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_1/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator_shinkai/in04_1/moments/SquaredDifference","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"Tidx":{"type":3},"keep_dims":{"b":true},"T":{"type":1}},"name":"generator_shinkai/in04_1/moments/variance","op":"Mean"},{"input":["generator_shinkai/in04_1/moments/variance","generator_shinkai/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_1/instancenorm/add","op":"Add"},{"input":["generator_shinkai/in04_1/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_1/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator_shinkai/in04_1/instancenorm/Rsqrt","generator_shinkai/in04_1/gamma"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_1/instancenorm/mul","op":"Mul"},{"input":["generator_shinkai/conv04_1/BiasAdd","generator_shinkai/in04_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_1/instancenorm/mul_1","op":"Mul"},{"input":["generator_shinkai/in04_1/moments/mean","generator_shinkai/in04_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_1/instancenorm/mul_2","op":"Mul"},{"input":["generator_shinkai/in04_1/beta","generator_shinkai/in04_1/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_1/instancenorm/sub","op":"Sub"},{"input":["generator_shinkai/in04_1/instancenorm/mul_1","generator_shinkai/in04_1/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_1/instancenorm/add_1","op":"Add"},{"input":["generator_shinkai/in04_1/instancenorm/add_1"],"attr":{"T":{"type":1}},"name":"generator_shinkai/Relu_3","op":"Relu"},{"input":["generator_shinkai/Relu_3","generator_shinkai/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator_shinkai/Pad_2","op":"Pad"},{"input":["generator_shinkai/Pad_2","generator_shinkai/conv04_2/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator_shinkai/conv04_2/Conv2D","op":"Conv2D"},{"input":["generator_shinkai/conv04_2/Conv2D","generator_shinkai/conv04_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator_shinkai/conv04_2/BiasAdd","op":"BiasAdd"},{"input":["generator_shinkai/conv04_2/BiasAdd","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"Tidx":{"type":3},"keep_dims":{"b":true}},"name":"generator_shinkai/in04_2/moments/mean","op":"Mean"},{"input":["generator_shinkai/conv04_2/BiasAdd","generator_shinkai/in04_2/moments/mean"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_2/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator_shinkai/in04_2/moments/SquaredDifference","generator_shinkai/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"Tidx":{"type":3},"keep_dims":{"b":true}},"name":"generator_shinkai/in04_2/moments/variance","op":"Mean"},{"input":["generator_shinkai/in04_2/moments/variance","generator_shinkai/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_2/instancenorm/add","op":"Add"},{"input":["generator_shinkai/in04_2/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_2/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator_shinkai/in04_2/instancenorm/Rsqrt","generator_shinkai/in04_2/gamma"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_2/instancenorm/mul","op":"Mul"},{"input":["generator_shinkai/conv04_2/BiasAdd","generator_shinkai/in04_2/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_2/instancenorm/mul_1","op":"Mul"},{"input":["generator_shinkai/in04_2/moments/mean","generator_shinkai/in04_2/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_2/instancenorm/mul_2","op":"Mul"},{"input":["generator_shinkai/in04_2/beta","generator_shinkai/in04_2/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_2/instancenorm/sub","op":"Sub"},{"input":["generator_shinkai/in04_2/instancenorm/mul_1","generator_shinkai/in04_2/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator_shinkai/in04_2/instancenorm/add_1","op":"Add"},{"input":["generator_shinkai/in04_2/instancenorm/add_1","generator_shinkai/Relu_2"],"attr":{"T":{"type":1}},"name":"generator_shinkai/add","op":"Add"},{"input":["generator_shinkai/add","generator_shinkai/Pad_15/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"generator_shinkai/Pad_3","op":"Pad"},{"input":["generator_shinkai/Pad_3","generator_shinkai/conv05_1/kernel"],